app/controllers/api/searches_controller.rb

    def search
        search_term = params[:search].downcase
        @songs = Song.where("title LIKE ?", "%#{search_term}%")
        @albums = Album.where("title LIKE ?", "%#{search_term}%")
        @artists = Artist.where("name LIKE ?", "%#{search_term}%")
---
SELECT "songs".* FROM "songs" WHERE (title LIKE '%V%')
SELECT "albums".* FROM "albums" WHERE (title LIKE '%V%')
SELECT "artists".* FROM "artists" WHERE (name LIKE '%v%')