app/views/api/artists/show.json.jbuilder

SELECT  "songs".* FROM "songs" INNER JOIN "albums" ON "songs"."album_id" = "albums"."id" WHERE "albums"."artist_id" = $1 LIMIT $2  [["artist_id", 45], ["LIMIT", 5]]
---
    json.popular do
        @artist.songs.limit(5).each do |song|

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 45]]
---
json.albums do
    @artist.albums.each do |album|