app/views/api/albums/show.json.jbuilder

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 52]]
---
    artist = @album.artist
    @album.songs_on_album.each do |song|