app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "T+HyxgeESStfzI1x99piLw=="], ["updated_at", "2021-02-09 01:41:01.931824"], ["id", 4]]
---
    def reset_session_token!
        self.session_token = SecureRandom::base64
        self.save!